<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Summary" data-toc-modified-id="Summary-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Summary</a></span></li><li><span><a href="#SQL---Main-Commands" data-toc-modified-id="SQL---Main-Commands-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>SQL - Main Commands</a></span><ul class="toc-item"><li><span><a href="#SELECT" data-toc-modified-id="SELECT-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>SELECT</a></span><ul class="toc-item"><li><span><a href="#Datset" data-toc-modified-id="Datset-2.1.1"><span class="toc-item-num">2.1.1&nbsp;&nbsp;</span>Datset</a></span></li><li><span><a href="#Problem-1-:" data-toc-modified-id="Problem-1-:-2.1.2"><span class="toc-item-num">2.1.2&nbsp;&nbsp;</span>Problem 1 :</a></span></li><li><span><a href="#Problem-2:" data-toc-modified-id="Problem-2:-2.1.3"><span class="toc-item-num">2.1.3&nbsp;&nbsp;</span>Problem 2:</a></span></li><li><span><a href="#Problem-3:" data-toc-modified-id="Problem-3:-2.1.4"><span class="toc-item-num">2.1.4&nbsp;&nbsp;</span>Problem 3:</a></span></li><li><span><a href="#Problem-4:" data-toc-modified-id="Problem-4:-2.1.5"><span class="toc-item-num">2.1.5&nbsp;&nbsp;</span>Problem 4:</a></span></li><li><span><a href="#Problem-5:" data-toc-modified-id="Problem-5:-2.1.6"><span class="toc-item-num">2.1.6&nbsp;&nbsp;</span>Problem 5:</a></span></li><li><span><a href="#Problem-6:" data-toc-modified-id="Problem-6:-2.1.7"><span class="toc-item-num">2.1.7&nbsp;&nbsp;</span>Problem 6:</a></span></li></ul></li><li><span><a href="#COUNT" data-toc-modified-id="COUNT-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>COUNT</a></span><ul class="toc-item"><li><span><a href="#Problem-1:" data-toc-modified-id="Problem-1:-2.2.1"><span class="toc-item-num">2.2.1&nbsp;&nbsp;</span>Problem 1:</a></span></li><li><span><a href="#Problem-2:" data-toc-modified-id="Problem-2:-2.2.2"><span class="toc-item-num">2.2.2&nbsp;&nbsp;</span>Problem 2:</a></span></li><li><span><a href="#Problem-3:" data-toc-modified-id="Problem-3:-2.2.3"><span class="toc-item-num">2.2.3&nbsp;&nbsp;</span>Problem 3:</a></span></li><li><span><a href="#Problem-4:" data-toc-modified-id="Problem-4:-2.2.4"><span class="toc-item-num">2.2.4&nbsp;&nbsp;</span>Problem 4:</a></span></li><li><span><a href="#Problem-5:" data-toc-modified-id="Problem-5:-2.2.5"><span class="toc-item-num">2.2.5&nbsp;&nbsp;</span>Problem 5:</a></span></li></ul></li><li><span><a href="#DISTINCT" data-toc-modified-id="DISTINCT-2.3"><span class="toc-item-num">2.3&nbsp;&nbsp;</span>DISTINCT</a></span><ul class="toc-item"><li><span><a href="#Problem-1:" data-toc-modified-id="Problem-1:-2.3.1"><span class="toc-item-num">2.3.1&nbsp;&nbsp;</span>Problem 1:</a></span></li><li><span><a href="#Problem-2:" data-toc-modified-id="Problem-2:-2.3.2"><span class="toc-item-num">2.3.2&nbsp;&nbsp;</span>Problem 2:</a></span></li><li><span><a href="#Problem-3:" data-toc-modified-id="Problem-3:-2.3.3"><span class="toc-item-num">2.3.3&nbsp;&nbsp;</span>Problem 3:</a></span></li><li><span><a href="#Problem-4:" data-toc-modified-id="Problem-4:-2.3.4"><span class="toc-item-num">2.3.4&nbsp;&nbsp;</span>Problem 4:</a></span></li><li><span><a href="#Problem-5:" data-toc-modified-id="Problem-5:-2.3.5"><span class="toc-item-num">2.3.5&nbsp;&nbsp;</span>Problem 5:</a></span></li></ul></li><li><span><a href="#LIMIT" data-toc-modified-id="LIMIT-2.4"><span class="toc-item-num">2.4&nbsp;&nbsp;</span>LIMIT</a></span><ul class="toc-item"><li><span><a href="#Problem-1:" data-toc-modified-id="Problem-1:-2.4.1"><span class="toc-item-num">2.4.1&nbsp;&nbsp;</span>Problem 1:</a></span></li><li><span><a href="#Problem-2:" data-toc-modified-id="Problem-2:-2.4.2"><span class="toc-item-num">2.4.2&nbsp;&nbsp;</span>Problem 2:</a></span></li><li><span><a href="#Problem-3:" data-toc-modified-id="Problem-3:-2.4.3"><span class="toc-item-num">2.4.3&nbsp;&nbsp;</span>Problem 3:</a></span></li><li><span><a href="#Problem-4:" data-toc-modified-id="Problem-4:-2.4.4"><span class="toc-item-num">2.4.4&nbsp;&nbsp;</span>Problem 4:</a></span></li><li><span><a href="#Problem-5:" data-toc-modified-id="Problem-5:-2.4.5"><span class="toc-item-num">2.4.5&nbsp;&nbsp;</span>Problem 5:</a></span></li></ul></li><li><span><a href="#INSERT" data-toc-modified-id="INSERT-2.5"><span class="toc-item-num">2.5&nbsp;&nbsp;</span>INSERT</a></span><ul class="toc-item"><li><span><a href="#Dataset" data-toc-modified-id="Dataset-2.5.1"><span class="toc-item-num">2.5.1&nbsp;&nbsp;</span>Dataset</a></span></li><li><span><a href="#Problem-1:" data-toc-modified-id="Problem-1:-2.5.2"><span class="toc-item-num">2.5.2&nbsp;&nbsp;</span>Problem 1:</a></span></li><li><span><a href="#Problem-2:" data-toc-modified-id="Problem-2:-2.5.3"><span class="toc-item-num">2.5.3&nbsp;&nbsp;</span>Problem 2:</a></span></li><li><span><a href="#Problem-3:" data-toc-modified-id="Problem-3:-2.5.4"><span class="toc-item-num">2.5.4&nbsp;&nbsp;</span>Problem 3:</a></span></li><li><span><a href="#Problem-4:" data-toc-modified-id="Problem-4:-2.5.5"><span class="toc-item-num">2.5.5&nbsp;&nbsp;</span>Problem 4:</a></span></li></ul></li><li><span><a href="#UPDATE" data-toc-modified-id="UPDATE-2.6"><span class="toc-item-num">2.6&nbsp;&nbsp;</span>UPDATE</a></span><ul class="toc-item"><li><span><a href="#Problem-1:" data-toc-modified-id="Problem-1:-2.6.1"><span class="toc-item-num">2.6.1&nbsp;&nbsp;</span>Problem 1:</a></span></li><li><span><a href="#Problem-2:" data-toc-modified-id="Problem-2:-2.6.2"><span class="toc-item-num">2.6.2&nbsp;&nbsp;</span>Problem 2:</a></span></li><li><span><a href="#Problem-3:" data-toc-modified-id="Problem-3:-2.6.3"><span class="toc-item-num">2.6.3&nbsp;&nbsp;</span>Problem 3:</a></span></li><li><span><a href="#Problem-4:" data-toc-modified-id="Problem-4:-2.6.4"><span class="toc-item-num">2.6.4&nbsp;&nbsp;</span>Problem 4:</a></span></li></ul></li><li><span><a href="#DELETE" data-toc-modified-id="DELETE-2.7"><span class="toc-item-num">2.7&nbsp;&nbsp;</span>DELETE</a></span><ul class="toc-item"><li><span><a href="#Problem-1:" data-toc-modified-id="Problem-1:-2.7.1"><span class="toc-item-num">2.7.1&nbsp;&nbsp;</span>Problem 1:</a></span></li><li><span><a href="#Problem-2:" data-toc-modified-id="Problem-2:-2.7.2"><span class="toc-item-num">2.7.2&nbsp;&nbsp;</span>Problem 2:</a></span></li><li><span><a href="#Problem3:" data-toc-modified-id="Problem3:-2.7.3"><span class="toc-item-num">2.7.3&nbsp;&nbsp;</span>Problem3:</a></span></li></ul></li></ul></li></ul></div>

# Summary


* **What I learned:**


    - Use Data Manipulation Language (DML) statements to read and modify data. 
    - The search condition of the WHERE clause uses a predicate to refine the search.​ 
    - COUNT, DISTINCT, and LIMIT​ are expressions that are used with SELECT statements​. 
    - INSERT, UPDATE, and DELETE are DML statements for populating and changing tables.

# SQL - Main Commands

## SELECT

In [2]:
# Sintax
'''
SELECT column1, column2, ...
FROM table_name
WHERE condition
;
'''

'SELECT column1, column2, ...\nFROM table_name\nWHERE condition\n;\n'

**FROM**: Specifies from which table to get the data. 
    The clause can include optional JOIN subclauses to specify the rules for joining tables.
    
 **WHERE** : Specifies which rows to retrieve.

### Datset
Database Used in this Lab
The database used in this lab comes from the following dataset source: 
Film Locations in San Francisco under a PDDL: Public Domain Dedication and License.

In [7]:
'''
dataset
FilmLocations(
    Title:              titles of the films, 
    ReleaseYear:        time of public release of the films, 
    Locations:          locations of San Francisco where the films were shot, 
    FunFacts:           funny facts about the filming locations, 
    ProductionCompany:  companies who produced the films, 
    Distributor:        companies who distributed the films, 
    Director:           people who directed the films, 
    Writer:             people who wrote the films, 
    Actor1:             person 1 who acted in the films, 
    Actor2:             person 2 who acted in the films, 
    Actor3:             person 3 who acted in the films
)
'''

'\ndataset\nFilmLocations(\n    Title:              titles of the films, \n    ReleaseYear:        time of public release of the films, \n    Locations:          locations of San Francisco where the films were shot, \n    FunFacts:           funny facts about the filming locations, \n    ProductionCompany:  companies who produced the films, \n    Distributor:        companies who distributed the films, \n    Director:           people who directed the films, \n    Writer:             people who wrote the films, \n    Actor1:             person 1 who acted in the films, \n    Actor2:             person 2 who acted in the films, \n    Actor3:             person 3 who acted in the films\n)\n'

### Problem 1 :
    Retrieve all records with all columns from the "FilmLocations" table.

Solution:

   SELECT * FROM FilmLocations;

### Problem 2:
    Retrieve the names of all films with director names and writer names.

Solution:

   SELECT Title, Director, Writer FROM FilmLocations;

### Problem 3:
     Retrieve the names of all films released in the 21st century and onwards (release years after 2001      including 2001), along with filming locations and release years.

Solution:

   SELECT Title, ReleaseYear, Locations FROM FilmLocations WHERE ReleaseYear>=2001;

### Problem 4:
    Retrieve the fun facts and filming locations of all films.

Solution:

   SELECT Locations, FunFacts FROM FilmLocations;

### Problem 5:
    Retrieve the names of all films released in the 20th century and before 
    (release years before 2000 including 2000) that, along with filming locations and release years.

Solution:

   SELECT Title, ReleaseYear, Locations FROM FilmLocations WHERE ReleaseYear<=2000;

### Problem 6:
    Retrieve the names, production company names, filming locations, 
    and release years of the films which are not written by James Cameron.

Solution:

   SELECT Title, ProductionCompany, Locations, ReleaseYear FROM FilmLocations WHERE Writer<>"James Cameron";

## COUNT

In [ ]:
# We will first go through some examples of using COUNT in queries 
# and then solve some exercise problems by using it.

### Problem 1:
    Retrieve the number of rows from the "FilmLocations" table.

Solution:

SELECT COUNT(*) FROM FilmLocations;

### Problem 2:
    In this example, now we want to count the number of locations of the films. 
        But we also want to restrict the output resultset in such a way that we only retrieve the number of locations of the films written by a certain writer.

    --> Retrieve the number of locations of the films which are written by James Cameron.

Solution:

SELECT COUNT(Locations) FROM FilmLocations WHERE Writer="James Cameron";

### Problem 3:

    Retrieve the number of locations of the films which are directed by Woody Allen.

Solution

SELECT COUNT(Locations) FROM FilmLocations WHERE Director="Woody Allen";

### Problem 4:

    Retrieve the number of films shot at Russian Hill.

Solution:

   SELECT Count(Title) FROM FilmLocations WHERE Locations="Russian Hill";

### Problem 5:

    Retrieve the number of rows having a release year older than 1950 from the "FilmLocations" table.

Solution:

   SELECT Count(*) FROM FilmLocations WHERE ReleaseYear<1950;

## DISTINCT

In [ ]:
# In this exercise, you will first go through some examples of using DISTINCT in queries, 
# and then solve some exercise problems by using it.

### Problem 1:

    In this example, we want to retrieve the title of all films in the table in such a way that duplicates will be discarded in the output resultset.

    --> Retrieve the name of all films without any repeated titles.

Solution:

SELECT DISTINCT Title FROM FilmLocations;

### Problem 2:
    In this example, we want to retrieve the count of release years of the films produced by 
    a specific company in such a way that duplicate release years of those films will be discarded 
    in the count.

    --> Retrieve the number of release years of the films distinctly, produced by Warner Bros. Pictures.

Solution:

SELECT COUNT(DISTINCT ReleaseYear) FROM FilmLocations WHERE ProductionCompany="Warner Bros. Pictures";

### Problem 3:

    Retrieve the name of all unique films released in the 21st century and onwards, along with their release years.

Solution:
    
SELECT DISTINCT Title, ReleaseYear FROM FilmLocations WHERE ReleaseYear>=2001;

### Problem 4:

    Retrieve the names of all the directors and their distinct films shot at City Hall.

Solution:

   SELECT DISTINCT Title, Director FROM FilmLocations WHERE Locations="City Hall";

### Problem 5:

    Retrieve the number of distributors distinctly who distributed films acted by Clint Eastwood as 1st actor.

Solution:
    
   SELECT COUNT(DISTINCT Distributor) FROM FilmLocations WHERE Actor1="Clint Eastwood";

## LIMIT

In [6]:
# In this exercise, you will first go through some examples of using LIMIT in queries and 
# then solve some exercise by using it.

### Problem 1:

    In this example, let us retrieve a specific number of rows from the top of the table in such a way that rows other than those are not in the output resultset.

    --> Retrieve the first 25 rows from the "FilmLocations" table.

Solution:

SELECT * FROM FilmLocations LIMIT 25;

### Problem 2:

    In this example, let us take the first example to a more advanced level. Now we want to retrieve a specific number of rows from the table, but thid time, not from the top of the table. This time we want to retrieve a specific number of rows starting from a specific row in the table.

    --> Retrieve the first 15 rows from the "FilmLocations" table starting from row 11.

Solution:

SELECT * FROM FilmLocations LIMIT 15 OFFSET 10;

### Problem 3:

    --> Retrieve the name of first 50 films distinctly.

Solution:
    
   SELECT DISTINCT Title FROM FilmLocations LIMIT 50;

### Problem 4:

    --> Retrieve first 10 film names distinctly released in 2015.

Solution:

   SELECT DISTINCT Title FROM FilmLocations WHERE ReleaseYear=2015 LIMIT 10;

### Problem 5:

    --> Retrieve the next 3 film names distinctly after first 5 films released in 2015.

Solution:

SELECT DISTINCT Title FROM FilmLocations WHERE ReleaseYear=2015 LIMIT 3 OFFSET 5;

## INSERT

In [ ]:
'''
How does the syntax of an INSERT statement look?

INSERT INTO table_name (column1, column2, ... )
VALUES (value1, value2, ... )
;
'''

### Dataset

In this part, you will use Datasette , an open source multi-tool for exploring and publishing data.

Database Used in this Lab
The dataset used in this lab is an internal database.

In [9]:
#Exploring the Database
'''
SELECT * FROM Instructor;
'''

SyntaxError: invalid syntax (<ipython-input-9-7efeb42efe1d>, line 1)

In [ ]:
'''
Instructor (
    ins_id:     unique identification number of the instructors,    
    lastname:   last name of the instructors,
    firstname:  first name of the instructors,
    city:       name of the cities where instructors are located,
    country:    two-letter country code of the countries where instructors are located
)'''

### Problem 1:

    In this example, suppose we want to insert a new single row into the Instructor table.
    
    --> Insert a new instructor record with id 4 for Sandip Saha who lives in Edmonton, CA into the "Instructor" table.

Solution:

INSERT INTO Instructor(ins_id, lastname, firstname, city, country)
VALUES(4, 'Saha', 'Sandip', 'Edmonton', 'CA');

### Problem 2:

    In this example, suppose we want to insert some new multiple rows into the Instructor table.

    --> Insert two new instructor records into the "Instructor" table. First record with id 5 for John Doe who lives in Sydney, AU. Second record with id 6 for Jane Doe who lives in Dhaka, BD.

Solution:

INSERT INTO Instructor(ins_id, lastname, firstname, city, country)
VALUES(5, 'Doe', 'John', 'Sydney', 'AU'), (6, 'Doe', 'Jane', 'Dhaka', 'BD');

### Problem 3:

    --> Insert a new instructor record with id 7 for Antonio Cangiano who lives in Vancouver, CA into the "Instructor" table.

Solution:
    
INSERT INTO Instructor(ins_id, lastname, firstname, city, country)
VALUES(7, 'Cangiano', 'Antonio', 'Vancouver', 'CA');

SELECT * FROM Instructor;

### Problem 4:

    Insert two new instructor records into the "Instructor" table. First record with id 8 for Steve Ryan who lives in Barlby, GB. Second record with id 9 for Ramesh Sannareddy who lives in Hyderabad, IN.

Solution:

   INSERT INTO Instructor(ins_id, lastname, firstname, city, country)
    
VALUES(8, 'Ryan', 'Steve', 'Barlby', 'GB'), (9, 'Sannareddy', 'Ramesh', 'Hyderabad', 'IN');

SELECT * FROM Instructor;

## UPDATE

In [8]:
'''
How does the syntax of an UPDATE statement look?

UPDATE table_name
SET column1 = value1, column2 = value2, ...
WHERE condition
;
'''

'\nHow does the syntax of an UPDATE statement look?\n\nUPDATE table_name\nSET column1 = value1, column2 = value2, ...\nWHERE condition\n;\n'

### Problem 1:

    In this example, we want to update one column of an existing row of the table.

    --> Update the city for Sandip to Toronto.

Solution:

UPDATE Instructor 
SET city='Toronto' 
WHERE firstname="Sandip";

### Problem 2:

    In this example, we want to update multiple columns of an existing row of the table.

    --> Update the city and country for Doe with id 5 to Dubai and AE respectively.

Solution:

UPDATE Instructor 
SET city='Dubai', country='AE' 
WHERE ins_id=5;

### Problem 3:

    --> Update the city of the instructor record to Markham whose id is 1.

Solution:
    
  UPDATE Instructor 
SET city='Markham' 
WHERE ins_id=1;

SELECT * FROM Instructor;

### Problem 4:

    --> Update the city and country for Sandip with id 4 to Dhaka and BD respectively.

Solution:

UPDATE Instructor 
SET city='Dhaka', country='BD' 
WHERE ins_id=4;

SELECT * FROM Instructor;

## DELETE

In [ ]:
'''
How does the syntax of a DELETE statement look?

DELETE FROM table_name
WHERE condition
;

'''

### Problem 1:

    In this example, we want to remove a row from the table.
    
    --> Remove the instructor record of Doe whose id is 6.

Solution:

DELETE FROM instructor
WHERE ins_id = 6;

### Problem 2:

    Remove the instructor record of Hima.

Solution:
    
DELETE FROM instructor

WHERE firstname = 'Hima';

### Problem3:
    Which of the following SQL statements will delete the authors with IDs of A10 and A11?
    
Solution:

   DELETE FROM AUTHOR WHERE AUTHOR_ID IN ('A10', 'A11')